mtosi_2.0/2.0ME/DDPs/ResourceTroubleManagement/IIS/xml/1-1b_sit_getActiveAlarmsRequest.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:hdr="http://www.tmforum.org/mtop/fmw/xsd/hdr/v1"  xmlns:nam="http://www.tmforum.org/mtop/fmw/xsd/nam/v1" xmlns:com="http://www.tmforum.org/mtop/nra/xsd/com/v1" xmlns:prc="http://www.tmforum.org/mtop/nra/xsd/prc/v1" xmlns:tns="http://www.tmforum.org/mtop/rtm/xsd/ar/v1" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="http://www.tmforum.org/mtop/rtm/xsd/ar/v1 ../xsd/AlarmRetrievalMessages.xsd  
http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Header>
    <hdr:header>
      <hdr:activityName>getActiveAlarms</hdr:activityName>
      <hdr:msgName>getActiveAlarmsRequest</hdr:msgName>
      <hdr:msgType>REQUEST</hdr:msgType>
      <hdr:senderURI>/MTOSI/InventoryOS</hdr:senderURI>
      <hdr:destinationURI>/MTOSI/EMS01</hdr:destinationURI>
      <hdr:communicationPattern>MultipleBatchResponse</hdr:communicationPattern>
      <hdr:communicationStyle>RPC</hdr:communicationStyle>
      <hdr:requestedBatchSize>500</hdr:requestedBatchSize>
      <hdr:timestamp>2007-07-30T09:26:00</hdr:timestamp>
    </hdr:header>
  </soap:Header>
  <soap:Body>
<tns:getActiveAlarmsRequest>
  <tns:filter>
  <!-- Retrieve all active alarms with matching expression based on Xpath 1.0 dialect
        perceivedSeverity=PS_INDETERMINATE 
        Verify BA for more details about supported expression operations
   -->
    <tns:source>EXTERNAL</tns:source>
    <tns:queryExpression Dialect="http://www.w3.org/TR/xpath">//alarm[perceivedSeverity= PS_INDETERMINATE]</tns:queryExpression>
  </tns:filter>
</tns:getActiveAlarmsRequest>
</soap:Body></soap:Envelope>